In [1]:
import pandas as pd

In [2]:
data=[["mark",55,"italy",4.5,"europe"],
      ["join",33,"usa",6.7,"america"],
      ["tim",41,"usa",5.4,"america"],
      ["jenny",12,"germany",9.0,"europe"]]

In [3]:
df=pd.DataFrame(data=data,
                columns=["name","age","country","score","continent"],
                index=[1001,1000,1002,1003])

In [4]:
df

       name  age  country  score continent
1001   mark   55    italy    4.5    europe
1000   join   33      usa    6.7   america
1002    tim   41      usa    5.4   america
1003  jenny   12  germany    9.0    europe

In [7]:
df.columns

Index(['name', 'age', 'country', 'score', 'continent'], dtype='object')

In [27]:
df["country"].isin(["europe","china"])

1001    False
1000    False
1002    False
1003    False
Name: country, dtype: bool

In [28]:
rainfall=pd.DataFrame(data={"city 1":[300.1,100.2],
                            "city 2":[400.3,300.4],
                            "city 3":[1000.5,1100.6]})

In [34]:
rainfall[ rainfall<400]

   city 1  city 2  city 3
0   300.1     NaN     NaN
1   100.2   300.4     NaN

In [35]:
df_multi=df.reset_index().set_index(["continent","country"])

In [39]:
df_multi

                   index   name  age  score
continent country
america   usa       1000   join   33    6.7
          usa       1002    tim   41    5.4
europe    germany   1003  jenny   12    9.0
          italy     1001   mark   55    4.5

In [53]:
df2.loc[[1001,1002],"score"]=[2,2.2]

In [64]:
df2.replace({"country":{"usa":"USa"}})

       name  age  country  score continent
1001  peter   55    italy    2.0    europe
1000   join   33      USa    6.7   america
1002    tim   41      USa    2.2   america
1003  jenny   12  germany    9.0    europe

In [70]:
df2.loc[:,"birth year"]=2021-df2["age"]

In [74]:
df2["bb"]=[22,33,44,55]

In [95]:
df3

       name   age  country  score continent  discount  birth year    bb
1001  peter  55.0    italy    2.0    europe       0.0      1966.0  22.0
1000   join  33.0      usa    6.7   america       0.0      1988.0  33.0
1002    tim  41.0      usa    2.2   america       0.0      1980.0  44.0
1003  jenny  12.0  germany    9.0    europe       0.0      2009.0  55.0
2000    NaN   NaN      NaN    NaN       NaN       NaN         NaN   NaN
1004   None   NaN     None    NaN      None       NaN         NaN   NaN

In [97]:
df3["age"].is_unique

False

In [99]:
users=pd.DataFrame(data=[" mArk","JOHN","Tim"," jenny"],
                   columns=["name"])

In [100]:
users

     name
0    mArk
1    JOHN
2     Tim
3   jenny

In [103]:
users_clearned=users.loc[:,"name"].str.strip().str.capitalize()

In [104]:
users_clearned

0     Mark
1     John
2      Tim
3    Jenny
Name: name, dtype: object

In [105]:
users.loc[:,"name"]

0      mArk
1      JOHN
2       Tim
3     jenny
Name: name, dtype: object